{
    "hi_all_i_am": "Hi all, i am",
    "Complete_the_game_to_continue": "Complete the game to continue",
    "you_can_also_see_it_on_my_Github_page": "you can also see it on my Github page",
    "find_my_profile_on_Github": "find my profile on Github",
    "find_me_in": "find me in",
    "hello": "hello",
    "about_me": "about-me",
    "projects": "projects",
    "contact_me": "contact-me",
    "Start_game": "Start Game",
    "Congratulation": "Congratulation !!!",
    "Game_Over": "Game Over",
    "use_keyboard": "use keyboard",
    "arrows_to_play": "arrows to play",
    "skip": "skip",
    "food_left": "food left",
    "personal_info": "personal-info",
    "bio": "bio",
    "who-i-am": "who-i-am",
    "education": "education",
    "high-school": "high-school",
    "university": "university",
    "after-school": "after-school",
    "restart": "restart",
    "freelance": "freelance",
    "hobbies": "hobbies",
    "sport": "sport",
    "handball": "handball",
    "music": "music",
    "guitar": "guitar",
    "about_content": {
        "personal_info": {
            "who-i-am": [
                "Iam passionate of tech, sciences, video games et japanese culture. Iam curious et little bit perfectionnist with strong patience. I can spend hours to try how something is working or to resolve a logic issue.",
                "What I love about computer development is that I find there's a \"magical\" aspect to creating an application, a website, a game, or anything else from simple instructions in a language that's anything but human.",
                "In my perspective, developers are the ones shaping the world of tomorrow. So naturally, my passion and enthusiasm drive me towards this path."
            ],
            "high-school": [
                "I completed my high school years at Lycée Claude Gellée in Epinal. I pursued a scientific track with a specialization in Earth and Life Sciences (SVT in french) and Introduction to Digital Sciences (ISN in french).",
                "My specialization in ISN, although not very in-depth, introduced me to how computers work, and I also wrote my first lines of code.",
                "I also created my first game in Python: a MasterMind.",
                "I will remember for the rest of my life the feeling I had when I launched my program and could finally play my own game!",
                "It was a mix of pride and satisfaction that I still feel today when I work on my projects.",
                "It became evident to me that my future career would be in software development."
            ],
            "university": [
                "After obtaining my Baccalauréat Scientifique with honors (yes, indeed), I enrolled in a DUT (Diplôme Universitaire Technologique) program at the IUT Nancy-Charlemagne.",
                "After obtaining my Baccalauréat Scientifique with honors (yes, indeed), I enrolled in a DUT (Diplôme Universitaire Technologique) program at the IUT (Institut Universitaire Technologique) in Nancy-Charlemagne.",
                "From the very first day, everything I saw, read, learned, or did confirmed without a doubt that I had found my path.",
                "I already had a good foundation, but I deepened my knowledge and also learned new languages, primarily Java and C.",
                "I discovered:",
                "- Object-oriented programming (which I didn't grasp the usefulness and functionality of immediately, but now seems indispensable and incredibly practical).",
                "- Networking (an extremely interesting field that almost convinced me to pursue it).",
                "- Databases (with MySQL and PostgreSQL)",
                "- Algorithmics (Strangely, of all the subjects, I think this is the one I liked the most. During these classes, we only had a pencil and our notebook. No computers, no screens, no IDE, just paper and a pencil. But my thing is solving problems, so in the end, not so strange after all 🙂)"
            ],
            "after-school": [
                "After my DUT, I wanted to enroll in an apprenticeship program for a bachelor's degree.",
                "I admit I started a bit late, but after some quick research, I found a company that would accept me for an apprenticeship.",
                "I'll spare you the details, but I ultimately couldn't join an apprenticeship program because the company took another intern instead of me.",
                "That year, I felt so defeated and disappointed that I didn't know what to do.",
                "My loved ones advised me to register with a temporary work agency so I wouldn't be idle.",
                "I was hired by a fiber optic network company, and I stayed in that field for 5 years.",
                "During my free time, I continued learning development through websites like Openclassroom, Stack Overflow, YouTube, and others.",
                "For 5 years, I got lost in the field of fiber optics before realizing that I wasn't where I belonged and that I was making a huge career mistake.",
                "I decided to leave the company I was working for to pursue my desire to work in development."
            ],
            "restart": [
                "With the help of Pôle Emploi (French employment agency), I enrolled in a diploma course for web developer/designer at Openclassrooms.",
                "I don't think I'm exaggerating when I say that this decision revived me. Granted, the training was intense, but I was genuinely enjoying doing what I love.",
                "This training allowed me to learn:",
                "- how to integrate a web page from a mockup (on Figma, for example).",
                "- to utilize GIT efficiently",
                "- React, NodeJS, Redux, MangoDB, Sass",
                "- The architecture of REST APIs.",
                "- The Agile methodology.",
                "- to read and create USE CASE diagrams.",
                "- to adhere to a specifications document.",
                "- to test my code with Jest (unit testing).",
                "- to make my code robust and validate the standards (W3C, ESLint).",
                "After obtaining my diploma, I started creating small personal projects like this website (all my projects are available on my GitHub 🙂) and also began looking for work. However, lacking experience in the field with a very atypical CV, companies did not follow up on my applications."
            ],
            "freelance": [
                "Several weeks passed, and still no positive response. To avoid staying unemployed, I decided to take a small job at La Poste to allow myself to continue applying for web development positions.",
                "After several months of unsuccessful applications, I decided to create my own sole proprietorship. During my numerous job applications and company searches, I noticed that many job offers were for freelancers.",
                "And there it is: LGPT Web is created on March 1, 2024! 👏",
                "Let's work together starting now! Contact me!"
            ]
        },
        "hobbies": {
            "handball": [
                "I have been playing handball since I was 14 years old. It's a passion passed down by my father that involves the whole family. I progressed up to the French championship level and played a few matches in National 3.",
                "Unfortunately, I had to stop for 2 years because of my job at that time. When I was able to resume, I had lost a lot of skill and kept getting injured.",
                "So today, I continue playing handball but at a much lower level for enjoyment and fitness."
            ],
            "guitar": [
                "Also passed down by my father, music is present every day of my life.",
                "I started learning guitar by borrowing my father's one.",
                "I learned for a long time as a self-taught guitarist, but around the age of 12, my parents enrolled me in classical guitar lessons (which I didn't enjoy 😭).",
                "Then I tried electric guitar (which was better), but the academic aspect, with homework, rehearsals, etc., took away the enjoyment of playing for me. So, eventually, I stopped taking lessons and continued learning on my own.",
                "Today, I play and sing occasionally to relax or on very rare festive occasions."
            ],
            "gaming": [
                "My passion for computers naturally led me to discover video games. My first real game was Zelda: The Wind Waker on Gamecube, which took me on a true adventure.",
                "For me, video games are a very complex and complete art form. Being able to embody a character, experience an adventure, and be immersed in a story is something that immediately appealed to me a lot.",
                "I recently finished the Endwalker expansion of Final Fantasy XIV, and there are no words to describe what I felt throughout the adventure except perhaps extraordinary and magnificent (these are euphemisms, and I choose my words carefully).",
                "I also enjoy the competitive aspect that video games offer. Rocket League (my favorite), League of Legends (even though I'm Bronze :/), Overwatch (unfortunately in the past now), and many others.",
                "In short, I'm a gamer."
            ]
        }
    },
    "in_dev_advertising": "This site is under development. Some pages or content may be missing or absent",
    "video_games": "video-games",
    "gaming": "gaming"
}
